Berichtencatalogus/uitgifteservice/DC_Request_Cirkel_error.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchCharacteristicsRequest 
                xmlns="http://www.broservices.nl/xsd/dsbhr/2.0"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsbhr/2.0 https://schema.broservices.nl/xsd/dsbhr/2.0/dsbhr-messages.xsd"
            >
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgiftewebservice.
                 Het is niet gevalideerd door de uitgiftewebservice en is vaktechnisch/inhoudelijk niet voorbeeldig.
            -->
            <requestReference>101</requestReference>
            <criteria>
                <brocom:area>
                    <brocom:enclosingCircle srsName="">
                        <brocom:center>52.287820209 5.090415499</brocom:center>
                        <brocom:radius uom="km">10</brocom:radius>
                    </brocom:enclosingCircle>
                </brocom:area>
            </criteria>
        </dispatchCharacteristicsRequest>
    </soap:Body>
</soap:Envelope>
